{
  "backend/main.mo": "Motoko actor managing user profiles with access control, wallet validation, and CRUD-style profile operations gated by permissions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Collection of short summaries for major frontend files including auth, queries, pages, components, and match-3 game logic.",
  "frontend/index.css": "Tailwind base and component layers defining light/dark OKLCH color tokens and global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Creates the TanStack router and root layout with auth/profile gating and global providers.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, attribution link, and social icons.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication controls, and user dropdown driven by auth and profile state.",
  "frontend/src/components/ProfileSetup.tsx": "React form for entering and saving a user's display name with validation and error handling.",
  "frontend/src/game/match3/engine.ts": "Core Match-3 logic including board initialization, adjacency checks, swapping, and match detection.",
  "frontend/src/game/match3/types.ts": "Defines grid size, tile types, and core Match-3 data structures like Board, Tile, and Match.",
  "frontend/src/game/match3/useMatch3Game.ts": "React hook managing Match-3 board state, tile selection, swaps, cascades, scoring, and restart logic.",
  "frontend/src/game/three/layout.ts": "Utility functions computing 3D world positions for tiles and stones using layout constants.",
  "frontend/src/game/three/materials.ts": "Maps tile types to Three.js colors and provides helpers for rendering stone colors.",
  "frontend/src/game/three/StoneMatch3DBoard.tsx": "3D React Three Fiber scene rendering the Match-3 board with interactive stones, tiles, lighting, and selection effects.",
  "frontend/src/game/three/useStoneAnimations.ts": "Tracks previous board state and animation info, and provides a helper for animating stone movement.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useAuth.ts": "Simple auth hook exposing whether the user is authenticated based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including loading, login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating user profiles and wallet addresses through an authenticated backend actor.",
  "frontend/src/index.css": "Sets global Tailwind CSS styles, color variables, dark mode theming, and custom styles for game tiles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ConnectWallet.tsx": "UI page for viewing, validating, linking, updating, and removing a user's wallet address with backend mutations.",
  "frontend/src/pages/GamePage.tsx": "Renders the 3D match‑3 game board, score display, and controls using the match‑3 game hook.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing hero content, user greeting, and navigation to the match‑3 game, using Internet Identity and profile data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata and current issues, including authentication fixes and 3D game glitching tasks for Stone Match 3D."
}