{
  "backend/main.mo": "Actor managing user profiles with access control, wallet address validation, and CRUD-style profile operations.",
  "feature_evidence.json": "Feature evidence listing match‑3 related improvements, impacted files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, especially match‑3 engine and UI screens.",
  "frontend/index.css": "Global Tailwind and OKLCH variable definitions plus base/dark theme tokens.",
  "frontend/index.html": "Simple HTML entry mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring authentication, routing, profile gating, theme provider, and layout.",
  "frontend/src/components/Footer.tsx": "Footer component with attribution, social links, and dynamic year.",
  "frontend/src/components/Header.tsx": "Header with navigation, login/logout logic, user menu, and game entry button.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form creating a user name on first login with validation and error handling.",
  "frontend/src/game/match3/engine.ts": "Implements core match-3 logic including board initialization, adjacency checks, swapping, and match detection.",
  "frontend/src/game/match3/types.ts": "Defines match-3 constants and TypeScript types for tiles, the board, matches, and cascade results.",
  "frontend/src/game/match3/useMatch3Game.ts": "React hook managing match-3 gameplay state, handling tile selection, swaps, cascades, scoring, and board resets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, session handling, and login state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls for user profile and wallet address operations using React Query with mutation helpers.",
  "frontend/src/index.css": "Tailwind base styles and theme variables plus minor game-specific styling.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/ConnectWallet.tsx": "UI page for viewing, validating, linking, updating, and removing a user’s wallet address with backend integration.",
  "frontend/src/pages/GamePage.tsx": "Renders the match-3 game UI, handling tile selection, display of the board, and fallback-safe tile image loading.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with authentication-aware greetings and a section promoting and linking to the Stone Match game.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Describes the project’s state, existing features, and tracked requirements for the Stone Match game."
}