{
  "backend/main.mo": "Motoko canister managing user profiles with access control, wallet validation, and profile CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files and assets.",
  "frontend/index.css": "Tailwind base and component layer definitions including OKLCH theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the React application entrypoint.",
  "frontend/src/App.tsx": "Main React app setup with routing, theme provider, authentication checks, and profile gate.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright info, caffeine.ai attribution, and social links.",
  "frontend/src/components/Header.tsx": "Header with navigation, login/logout handling, profile dropdown, and Play Game button.",
  "frontend/src/components/ProfileSetup.tsx": "React form for entering and saving a user's display name using saveCallerUserProfile.",
  "frontend/src/game/match3/engine.ts": "Core Match-3 engine implementing board generation, swapping, match detection, clearing, and related helpers.",
  "frontend/src/game/match3/types.ts": "Type definitions and constants for Match-3 tiles, board, matches, and swap results.",
  "frontend/src/game/match3/useMatch3Game.ts": "React hook managing Match-3 state, tile selection, swaps, scoring, cascades, and restart logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, identity persistence, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "React-query wrappers for fetching and mutating user profile and wallet address via the backend actor.",
  "frontend/src/index.css": "Tailwind base setup plus custom CSS variables, dark theme, and game tile interaction rules.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity, and global styles.",
  "frontend/src/pages/ConnectWallet.tsx": "Page for authenticated users to view, link, update, or remove a stored crypto wallet address with validation and mutation hooks.",
  "frontend/src/pages/GamePage.tsx": "Renders the match‑3 game board, handling tile selection, animations, scoring, and restart via the useMatch3Game hook.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing branding, welcome message, and entry points to authentication features and the Stone Match game.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, typography, animations, and container settings for the UI theme.",
  "project_state.json": "Metadata describing project version, features, visual requirements, and current development state."
}