{
  "kind": "build_request",
  "title": "Add bright stone-themed 2D match-3 game",
  "projectName": "Stone Match",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a new Match-3 game screen that runs entirely in the browser: render a 2D grid of bright, cut-stone tiles; allow the player to swap adjacent tiles via mouse/touch; detect matches of 3 or more identical tiles; clear matched tiles; drop tiles down to fill gaps; and refill with new random tiles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make a 2D game where you have to match 3 or more of the same cut object to get points,  make it bright colors of stone's."
        ]
      },
      "acceptanceCriteria": [
        "A new route (e.g., /game) displays the match-3 board and can be opened without errors.",
        "The board uses a consistent grid size (e.g., 8x8) with at least 5 distinct tile types.",
        "Players can swap only adjacent tiles using mouse and touch interactions.",
        "After a swap, any horizontal or vertical match of 3+ identical tiles is detected and cleared.",
        "Tiles above cleared spaces fall downward and new tiles spawn to refill the grid until stable (no immediate matches remain, or the system resolves cascades deterministically).",
        "A score counter increments based on cleared tiles (at minimum: +10 per tile cleared), including cascades."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add basic game HUD and controls: show current score, a simple restart/new game control, and a short on-screen instruction block explaining how to play (English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "...match 3 or more... to get points..."
        ]
      },
      "acceptanceCriteria": [
        "HUD displays score and updates immediately after matches are cleared.",
        "A restart/new game action resets score and regenerates a new board.",
        "Instructions are visible on the game screen and are written in English."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Integrate the Match-3 game into the existing React app navigation by adding a clear entry point from the current UI (e.g., in the header menu and/or the home page) and register the new route in the app router.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make a 2D game..."
        ]
      },
      "acceptanceCriteria": [
        "The router in frontend/src/App.tsx includes a route to the game page.",
        "The existing header (frontend/src/components/Header.tsx) and/or home page (frontend/src/pages/HomePage.tsx) provides a visible way to navigate to the game page.",
        "Navigation to/from the game page works without requiring changes to immutable hook files."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Apply a bright, stone-themed visual style to the game screen: vivid gem/stone colors, high-contrast readable HUD text, and a playful arcade feel consistent across the game UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make it bright colors of stone's."
        ]
      },
      "acceptanceCriteria": [
        "Game tiles and background use a bright, stone/gem-inspired palette (not muted).",
        "Text (score/instructions/buttons) meets basic readability (clear contrast against backgrounds).",
        "Game screen styling is consistent (spacing, typography, button styles) and uses Tailwind + existing UI components where appropriate."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add static image assets for the match-3 game as generated files under frontend/public/assets/generated and use them in the game UI (tiles and optionally a background).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "...cut object...bright colors of stone's."
        ]
      },
      "acceptanceCriteria": [
        "All new images are stored under frontend/public/assets/generated and referenced by URL paths from the frontend.",
        "The game uses the generated tile images (or a generated sprite sheet) for rendering tiles.",
        "No backend image routing is introduced."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing components instead).",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend as a single Motoko actor in backend/main.mo; only add backend changes if explicitly required by the game.",
    "All user-facing text added for the game must be in English."
  ],
  "nonGoals": [
    "Do not add real-money payments, wallet-based gameplay, or third-party wallet integrations for the game.",
    "Do not add multiplayer, real-time features, chat, or WebSocket-based syncing.",
    "Do not integrate external databases or external game services.",
    "Do not implement complex level progression/maps unless separately requested (endless / arcade match-3 is sufficient).",
    "Do not remove or rewrite existing authentication/wallet/profile features unless necessary for navigation to the game page."
  ],
  "imageRequirements": {
    "required": [
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-red.dim_256x256.png)",
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-blue.dim_256x256.png)",
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-green.dim_256x256.png)",
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-yellow.dim_256x256.png)",
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-purple.dim_256x256.png)",
      "Bright faceted cut-stone tile set, 6 distinct colors, each as separate transparent PNG (stone-tile-orange.dim_256x256.png)",
      "Bright colorful stone/gem cavern background, soft gradients, subtle texture (stone-match-bg.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}