{
  "kind": "build_request",
  "title": "Fix Internet Identity login state mismatch and Stone Match 3D board glitching",
  "projectName": "Stone Match 3D",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the authentication gating so the app consistently treats a user as logged in when a valid Internet Identity is already loaded from storage (without requiring `loginStatus === \"success\"`). Update `frontend/src/App.tsx` and any related UI logic to use a single, correct definition of “authenticated” based on the presence of a non-anonymous identity, and ensure routing/profile-gate behavior works after page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix the login issue,  and the glitching in the stone match 3D game."
        ]
      },
      "acceptanceCriteria": [
        "After a successful Internet Identity login, refreshing the page keeps the user recognized as logged in (no unexpected return to logged-out state).",
        "The profile setup gate still appears for authenticated users who do not yet have a profile, including after a page reload.",
        "No route tree / router re-creation issues occur during auth state transitions (navigation remains stable across login/logout/reload)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent authenticated-profile React Query calls from running in an unauthenticated/anonymous state and handle backend authorization traps cleanly. Update `frontend/src/hooks/useQueries.ts` so `useGetCallerUserProfile` and wallet-related queries/mutations only execute when the user is truly authenticated, and ensure errors caused by missing auth (e.g., unauthorized traps) do not create a broken login loop or persistent error state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix the login issue,  and the glitching in the stone match 3D game."
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, profile and wallet queries do not spam errors such as \"Actor not available\" or backend \"Unauthorized\" traps.",
        "After login, profile and wallet queries successfully run and populate UI without requiring a manual refresh.",
        "After logout, cached authenticated data is cleared and protected queries do not re-run until the next successful login."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the Stone Match 3D gameplay “glitching” by stabilizing stone rendering and state transitions during swaps/cascades. In `frontend/src/game/three/StoneMatch3DBoard.tsx` and related match-3 state management, eliminate visual flicker/jumping caused by remounting stones (e.g., unstable React keys tied to changing tile IDs) and ensure interaction is correctly disabled while animations/state transitions are in progress.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix the login issue,  and the glitching in the stone match 3D game."
        ]
      },
      "acceptanceCriteria": [
        "During a valid swap and subsequent cascade resolution, stones do not visually flicker, duplicate, or appear to “teleport” due to component remounting.",
        "Each grid cell always displays exactly one stone throughout gameplay, including during cascades.",
        "User input is ignored while the game is animating/resolving a move (no double-click swap glitches or selection desync)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/hooks/useInternetIdentity.ts` or other paths listed in `frontend.immutablePaths`; apply fixes by adjusting consuming components/hooks instead.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only introduce a `backend/migration.mo` if a state schema change is required."
  ],
  "nonGoals": [
    "Adding new gameplay features (power-ups, timers, multiplayer, leaderboards).",
    "Changing authentication providers (must remain Internet Identity).",
    "Introducing external databases or non-IC backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}