{
  "kind": "build_request",
  "title": "Fix Stone Match 2D match-3 gameplay issues",
  "projectName": "Stone Match",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Stabilize the Match-3 game state updates so rapid user clicks cannot produce inconsistent board state (e.g., swaps applied to a stale board), and ensure the board/selection/animation state transitions are deterministic and correct.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Can you fix the 2D match game?"
        ]
      },
      "acceptanceCriteria": [
        "Repeated rapid clicking during normal play does not cause duplicated/ignored swaps, broken selection state, or a frozen isAnimating state.",
        "After any completed move (including cascades), the rendered board matches the latest computed board state and the selected tile is cleared.",
        "No React console errors occur during normal play (including rapid interaction)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix Match-3 scoring and match accounting so cleared tiles are counted correctly (no double-counting and no under-counting for overlapping match shapes), and the displayed score reliably matches the number of tiles actually cleared across the initial match and all cascades.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Can you fix the 2D match game?"
        ]
      },
      "acceptanceCriteria": [
        "Score increments by exactly 10 points per unique tile cleared across the full move resolution (initial clear + cascades).",
        "Overlapping match patterns (e.g., T/L shapes where a tile participates in both a horizontal and vertical match) are counted once per cleared tile.",
        "Score never decreases and never increments when a swap is rejected as invalid."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden the Match-3 render path to prevent invalid tile types from being rendered (e.g., temporary cleared markers) and ensure tile images always resolve to a valid asset throughout gameplay.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Can you fix the 2D match game?"
        ]
      },
      "acceptanceCriteria": [
        "The game never attempts to render an out-of-range TILE_IMAGES index (no broken image icons due to invalid tile.type).",
        "During match resolution, the UI either avoids rendering cleared placeholders or safely renders a defined fallback for any transient state.",
        "Gameplay continues normally after many moves without visual corruption."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit any files listed in frontend.immutablePaths (compose around them instead).",
    "Keep all game logic in the existing Match-3 module structure under frontend/src/game/match3/ (no new backend dependencies)."
  ],
  "nonGoals": [
    "Adding new game modes, power-ups, timers, levels, or monetization.",
    "Changing Internet Identity authentication, profiles, or wallet features.",
    "Introducing backend persistence for game progress or score."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}