{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ask Big Sister — Connect Wallet (link wallet address) UI + flow",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Add a visible “Connect Wallet” entry point for signed-in users and a screen that explains it links an address (not a live wallet connection).",
      "acceptanceCriteria": [
        "When a user is signed in, they can access a visible “Connect Wallet” action from the app navigation or profile area.",
        "The screen clearly indicates this feature links a wallet address to the user profile (not a live wallet connection).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ConnectWallet.tsx",
          "operation": "create",
          "description": "Create the Connect Wallet screen UI and explanatory copy clarifying it stores/links a wallet address to the user profile and is not a live wallet connection. Use shadcn-ui components (e.g., Card, Button, Input, Alert) for consistent layout and messaging; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Connect Wallet entry point into the signed-in user navigation/profile area and register navigation to the Connect Wallet screen/route. Ensure the entry point is only shown when Internet Identity is authenticated (via existing auth state)."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement view/add/edit/remove linked wallet address flow with validation, optimistic UI updates, and clear error handling using backend wallet-address APIs.",
      "acceptanceCriteria": [
        "The Connect Wallet screen shows the currently linked wallet address (if present).",
        "Users can enter a wallet address and save it; invalid/empty input is rejected with an English validation message.",
        "Users can remove the linked wallet address and the UI updates immediately to reflect the change.",
        "Errors from the canister are surfaced to the user in a clear English message, and the UI remains usable after an error."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWalletAddress.ts",
          "operation": "create",
          "description": "Add a React Query hook wrapping wallet address read/update/clear calls using the existing actor from useActor, including loading/error states, cache invalidation, and immediate UI updates after successful mutations."
        },
        {
          "path": "frontend/src/pages/ConnectWallet.tsx",
          "operation": "modify",
          "description": "Implement the full flow: fetch and display current wallet address, allow add/edit with basic validation (reject empty/invalid format with English messages), allow remove/unlink, and surface backend errors in a clear English message while keeping the UI usable. Use shadcn-ui form/feedback components (e.g., Input, Button, Alert) for validation and error display; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}