{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix II auth state mismatch and stabilize Stone Match 3D rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Unify “authenticated” detection (non-anonymous identity) and stabilize routing/profile-gate behavior across reloads without router re-creation glitches.",
      "acceptanceCriteria": [
        "After a successful Internet Identity login, refreshing the page keeps the user recognized as logged in (no unexpected return to logged-out state).",
        "The profile setup gate still appears for authenticated users who do not yet have a profile, including after a page reload.",
        "No route tree / router re-creation issues occur during auth state transitions (navigation remains stable across login/logout/reload)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "create",
          "description": "Add a small auth-state helper hook that derives a single, correct `isAuthenticated` boolean from `useInternetIdentity()` based on presence of a non-anonymous identity (do not depend on `loginStatus === \"success\"`). This will be consumed by routing/UI gates. (Uses selected component: authorization — follow its frontend guidance for treating anonymous principals as guests. Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor app composition so the router/routeTree are created once (module-scope or memoized) and are not recreated during auth/profile-gate transitions; move profile-setup gating into a stable routed layout (e.g., in `Layout` render `ProfileSetup` instead of `Outlet` when `showProfileSetup` is true) while using `useAuth()` for consistent authentication detection. Ensure the profile gate logic uses `isAuthenticated && !profileLoading && isFetched && userProfile === null` and remains correct after reload. (Uses selected component: authorization — implement the login/profile-gate behavior per its frontend recommendations. Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update header auth UI to use the shared `useAuth()` definition (non-anonymous identity) so login/logout state is consistent with app gating; keep logout clearing React Query cache and navigation stable. (Uses selected component: authorization — clear cached application data on logout per guidance. Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/ConnectWallet.tsx",
          "operation": "modify",
          "description": "Replace the local `isAuthenticated` check (`loginStatus === \"success\"`) with the shared `useAuth()` check so the wallet page guard works correctly after reload and does not incorrectly treat stored identities as logged-out."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Gate profile and wallet React Query operations behind true authentication and handle unauthorized/anonymous errors without loops; clear authenticated caches on logout.",
      "acceptanceCriteria": [
        "When not logged in, profile and wallet queries do not spam errors such as \"Actor not available\" or backend \"Unauthorized\" traps.",
        "After login, profile and wallet queries successfully run and populate UI without requiring a manual refresh.",
        "After logout, cached authenticated data is cleared and protected queries do not re-run until the next successful login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useGetCallerUserProfile` and wallet-related queries/mutations to only execute when the user is truly authenticated (use `useAuth()` to drive `enabled`/guards rather than relying on `!!actor`, since an anonymous actor exists). Add clean handling for authorization-trap style errors (e.g., treat as unauthenticated/guest and avoid retries/persistent error state), and ensure cache invalidation/clearing behavior supports logout (do not refetch protected queries when unauthenticated). (Uses selected component: authorization — follow its guidance for preventing profile setup modal flash and handling backend `trap` authorization failures gracefully. Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure logout continues to clear cached authenticated data (React Query) and that UI does not immediately re-trigger protected queries while unauthenticated (align with updated query gating). (Uses selected component: authorization — clear all cached application data on logout. Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Eliminate Stone Match 3D flicker/teleport glitches by using stable rendering keys and ensuring input is disabled during swap/cascade resolution.",
      "acceptanceCriteria": [
        "During a valid swap and subsequent cascade resolution, stones do not visually flicker, duplicate, or appear to “teleport” due to component remounting.",
        "Each grid cell always displays exactly one stone throughout gameplay, including during cascades.",
        "User input is ignored while the game is animating/resolving a move (no double-click swap glitches or selection desync)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/three/StoneMatch3DBoard.tsx",
          "operation": "modify",
          "description": "Stabilize stone rendering by replacing unstable React keys tied to changing tile IDs (e.g., `key={tile.id}`) with stable per-cell keys (e.g., derived from row/col) so stones do not remount during cascades/refills; additionally ensure pointer interactions remain blocked while `isAnimating` is true (including preventing hover/click side effects)."
        },
        {
          "path": "frontend/src/game/match3/useMatch3Game.ts",
          "operation": "modify",
          "description": "Tighten interaction locking during swap/cascade resolution so clicks are ignored throughout the full resolving window; ensure `isAnimating` is set/cleared in a way that cannot be bypassed by rapid input (keep the ref-based guard correct and aligned with the board's `disabled` behavior)."
        }
      ]
    }
  ]
}