{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stone Match: Deterministic Match-3 state, scoring, and safe rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Match-3 move resolution deterministic and immune to rapid clicks by eliminating stale state usage and enforcing a single in-flight resolution state machine.",
      "acceptanceCriteria": [
        "Repeated rapid clicking during normal play does not cause duplicated/ignored swaps, broken selection state, or a frozen isAnimating state.",
        "After any completed move (including cascades), the rendered board matches the latest computed board state and the selected tile is cleared.",
        "No React console errors occur during normal play (including rapid interaction)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/match3/useMatch3Game.ts",
          "operation": "modify",
          "description": "Refactor the hook to avoid stale `board` closures during swaps (use functional state updates and/or refs for latest board), serialize interactions so only one move resolves at a time, and ensure `selectedTile`/`isAnimating` transitions always complete (including early returns and invalid swaps)."
        },
        {
          "path": "frontend/src/game/match3/engine.ts",
          "operation": "modify",
          "description": "Adjust the engine APIs as needed to support a single deterministic move resolution flow (swap -> resolve clears/cascades -> final board) that the hook can call without relying on timeouts and intermediate stale board variables."
        },
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Align the UI interaction wiring with the deterministic hook behavior (ensure tile clicks delegate only to the hook, and disabling/pointer-blocking during animation does not leave the board stuck or selection uncleared)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix scoring to count exactly 10 points per unique cleared tile per full move (initial clear + cascades), with overlap-safe accounting and no score changes on invalid swaps.",
      "acceptanceCriteria": [
        "Score increments by exactly 10 points per unique tile cleared across the full move resolution (initial clear + cascades).",
        "Overlapping match patterns (e.g., T/L shapes where a tile participates in both a horizontal and vertical match) are counted once per cleared tile.",
        "Score never decreases and never increments when a swap is rejected as invalid."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/match3/engine.ts",
          "operation": "modify",
          "description": "Update match accounting to return (or make computable) the set/count of uniquely cleared tiles per resolution step using stable tile identity (e.g., tile.id) so overlaps are counted once and cascades aggregate correctly."
        },
        {
          "path": "frontend/src/game/match3/useMatch3Game.ts",
          "operation": "modify",
          "description": "Compute score increments using the engine-provided unique cleared tile count across the full move resolution; ensure invalid swaps return without mutating score and that score updates are derived from the resolved move result only."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Prevent invalid/transient tile types from reaching the render path and ensure tile images always resolve to a valid asset or defined fallback during gameplay.",
      "acceptanceCriteria": [
        "The game never attempts to render an out-of-range TILE_IMAGES index (no broken image icons due to invalid tile.type).",
        "During match resolution, the UI either avoids rendering cleared placeholders or safely renders a defined fallback for any transient state.",
        "Gameplay continues normally after many moves without visual corruption."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/match3/types.ts",
          "operation": "modify",
          "description": "Tighten and/or extend Match-3 types to represent any transient cleared state safely (instead of relying on an untyped sentinel), enabling compile-time protection against invalid `tile.type` rendering."
        },
        {
          "path": "frontend/src/game/match3/engine.ts",
          "operation": "modify",
          "description": "Remove unsafe mutation that can introduce invalid tile types into live board objects, and ensure cleared/transient states are represented in a way that the UI can safely handle (no out-of-range tile.type values)."
        },
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Harden tile rendering by guarding TILE_IMAGES access (render nothing or a defined fallback when a cell is cleared/transient) so the UI never indexes TILE_IMAGES with an invalid value."
        }
      ]
    }
  ]
}