{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stone Match: 3D board rendering with strict one-stone-per-tile match-3 rules",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Enforce one-stone-per-tile board representation and match-3-only clearing rules, and describe the rule in-game.",
      "acceptanceCriteria": [
        "The in-memory board representation guarantees a single stone per (row,col) position (no stacking/multiple occupancy).",
        "A swap only clears stones when it creates a contiguous horizontal or vertical match of 3 or more stones of the same color.",
        "User-facing help text on the game screen describes the rule as matching 3 (or more) stones of the same color."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/match3/types.ts",
          "operation": "modify",
          "description": "Clarify/strengthen board invariants in types/comments so the Board remains a strict 2D grid (exactly one Tile per [row][col]) suitable for 3D rendering."
        },
        {
          "path": "frontend/src/game/match3/engine.ts",
          "operation": "modify",
          "description": "Add lightweight runtime assertions/helpers to validate the board remains an 8x8 grid with exactly one Tile per cell, and keep swap resolution limited to contiguous horizontal/vertical 3+ matches only."
        },
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Update the on-screen instructions/help text to explicitly mention 'one stone per tile' and 'match 3+ stones of the same color' while keeping the existing UI shell."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Replace 2D grid rendering with a React Three Fiber 3D scene showing an 8x8 board and one 3D stone per tile, preserving click-to-select and adjacent swap interaction.",
      "acceptanceCriteria": [
        "The /game page renders a 3D scene (Canvas) with a clearly 3D board and stones (perspective, lighting, and depth).",
        "Each logical tile on the board is represented by exactly one 3D stone mesh positioned over its tile.",
        "Stone colors in 3D are consistent with the existing tile type/color mapping used by the match logic.",
        "Clicking/selecting and swapping stones remains functional using the existing match-3 interaction model (select stone, then select adjacent stone to swap)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Replace the 2D grid-of-images board area with a 3D board view component while preserving score/controls/instructions and keeping selection + swap behavior wired to useMatch3Game()."
        },
        {
          "path": "frontend/src/game/three/StoneMatch3DBoard.tsx",
          "operation": "create",
          "description": "Create a React Three Fiber board renderer that displays an 8x8 grid of 3D tiles and exactly one 3D stone mesh per logical Tile, using textures from frontend/public/assets/generated/stone-tile-texture.dim_1024x1024.png and frontend/public/assets/generated/stone-texture-base.dim_1024x1024.png and tinting stone materials by TileType."
        },
        {
          "path": "frontend/src/game/three/materials.ts",
          "operation": "create",
          "description": "Centralize TileType->color/material mapping for the 3D scene to ensure visual colors stay consistent with match-3 logic and any existing type ordering."
        },
        {
          "path": "frontend/src/game/three/layout.ts",
          "operation": "create",
          "description": "Add shared constants/helpers for mapping (row,col) to 3D world positions (spacing, centering, heights) so each tile and its single stone are placed consistently."
        },
        {
          "path": "frontend/public/assets/generated/stone-tile-texture.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated seamless stone tile texture asset at this exact path and wire it for 3D tile materials in the 3D board."
        },
        {
          "path": "frontend/public/assets/generated/stone-texture-base.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated seamless stone base texture asset at this exact path and wire it for 3D stone materials in the 3D board."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add 3D selection highlighting and basic swap/clear/cascade animations while preventing input during animation using the existing isAnimating lockout.",
      "acceptanceCriteria": [
        "A selected stone/tile is visually highlighted in 3D (e.g., outline, glow, scale, or ring) and updates correctly as the selection changes/clears.",
        "When a valid swap occurs, stones animate to their new positions rather than instantly teleporting (within a short, consistent duration).",
        "When matches clear and the board refills/cascades, the 3D scene visually reflects the change with a minimal clear/refill animation (e.g., scale down/up or fade).",
        "User input is ignored/disabled while swap/cascade animations are running, and re-enabled once the board is stable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/three/StoneMatch3DBoard.tsx",
          "operation": "modify",
          "description": "Implement 3D interaction feedback (selected highlight) and ensure pointer interaction is disabled when isAnimating is true; keep selection + swap calls routed through the existing selectTile() API."
        },
        {
          "path": "frontend/src/game/three/useStoneAnimations.ts",
          "operation": "create",
          "description": "Add a small animation controller/hook that animates stone transforms based on board changes (swap motion, clear scale/fade, and refill/cascade settle) and exposes an animation-in-progress signal that respects the existing isAnimating lockout semantics."
        },
        {
          "path": "frontend/src/game/match3/useMatch3Game.ts",
          "operation": "modify",
          "description": "Coordinate game state transitions with 3D animation timing so swaps/cascades are visually understandable, and ensure input remains locked out while animations are running (consistent with existing isAnimating behavior)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Keep the existing 2D game UI shell but swap in the responsive 3D board view without overflow and without any remaining broken image references for the board.",
      "acceptanceCriteria": [
        "The score panel, New Game control, and How to Play section remain visible and functional.",
        "The 3D board fits within the prior board container area and scales down appropriately on smaller viewports.",
        "No broken image references remain for stones in the /game board area after the 3D view is introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Preserve the existing page layout (background, score card, controls, instructions) and replace only the board area with the 3D board container sized to the prior max width and responsive on small screens; remove the board-area <img>-based stone rendering."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust minimal global styles (using existing entry point) to ensure the 3D Canvas container is responsive (square aspect, max width constraints) and does not overflow within the existing Card layout."
        }
      ]
    }
  ]
}